# ═══════════════════════════════════════════════════════════════════════════
# NOIZYLAB ULTIMATE Brewfile - HOT RODDED EDITION
# Run: brew bundle
# ═══════════════════════════════════════════════════════════════════════════

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "oven-sh/bun"

# ═══════════════════════════════════════════════════════════════════════════
# CLI ESSENTIALS
# ═══════════════════════════════════════════════════════════════════════════
brew "git"                    # Version control
brew "git-lfs"                # Large file storage
brew "gh"                     # GitHub CLI
brew "jq"                     # JSON processor
brew "yq"                     # YAML processor
brew "ripgrep"                # Fast grep (rg)
brew "fd"                     # Fast find
brew "eza"                    # Modern ls replacement
brew "bat"                    # Cat with syntax highlighting
brew "fzf"                    # Fuzzy finder
brew "tree"                   # Directory tree
brew "htop"                   # Process viewer
brew "watch"                  # Run commands periodically
brew "wget"                   # HTTP downloads
brew "curl"                   # HTTP client
brew "httpie"                 # User-friendly HTTP client

# ═══════════════════════════════════════════════════════════════════════════
# DEVELOPMENT
# ═══════════════════════════════════════════════════════════════════════════
brew "python@3.12"            # Python 3.12
brew "node"                   # Node.js
brew "pnpm"                   # Fast npm alternative
brew "uv"                     # Fast Python package manager
brew "rust"                   # Rust toolchain
brew "go"                     # Go language
brew "just"                   # Command runner (like make)

# ═══════════════════════════════════════════════════════════════════════════
# AUDIO / MEDIA
# ═══════════════════════════════════════════════════════════════════════════
brew "ffmpeg"                 # Audio/video processing
brew "sox"                    # Sound processing
brew "imagemagick"            # Image processing
brew "yt-dlp"                 # Video/audio downloader

# ═══════════════════════════════════════════════════════════════════════════
# CONTAINERS / CLOUD
# ═══════════════════════════════════════════════════════════════════════════
brew "docker"                 # Containers
brew "docker-compose"         # Container orchestration
brew "kubectl"                # Kubernetes CLI
brew "awscli"                 # AWS CLI
brew "terraform"              # Infrastructure as code

# ═══════════════════════════════════════════════════════════════════════════
# SECURITY
# ═══════════════════════════════════════════════════════════════════════════
brew "gnupg"                  # GPG encryption
brew "age"                    # Modern encryption
brew "sops"                   # Secret management

# ═══════════════════════════════════════════════════════════════════════════
# APPLICATIONS (Casks)
# ═══════════════════════════════════════════════════════════════════════════
cask "visual-studio-code-insiders"  # Editor
cask "iterm2"                 # Better terminal
cask "docker"                 # Docker Desktop
cask "raycast"                # Launcher (replace Spotlight)
cask "1password-cli"          # Password manager CLI
cask "slack"                  # Communication
cask "discord"                # Communication
cask "zoom"                   # Video calls
cask "obsidian"               # Notes
cask "notion"                 # Docs/wiki

# ═══════════════════════════════════════════════════════════════════════════
# FONTS
# ═══════════════════════════════════════════════════════════════════════════
cask "font-fira-code"         # Coding font with ligatures
cask "font-jetbrains-mono"    # JetBrains coding font
cask "font-meslo-lg-nerd-font"  # Powerline-compatible font

# ═══════════════════════════════════════════════════════════════════════════
# SHELL ENHANCEMENTS
# ═══════════════════════════════════════════════════════════════════════════
brew "zsh-autosuggestions"    # Fish-like suggestions
brew "zsh-syntax-highlighting" # Syntax colors in shell
brew "starship"               # Cross-shell prompt
brew "direnv"                 # Per-directory env vars
brew "zoxide"                 # Smart cd replacement

# ═══════════════════════════════════════════════════════════════════════════
# ADDITIONAL DEVELOPMENT
# ═══════════════════════════════════════════════════════════════════════════
brew "bun"                    # Fast JS runtime
brew "deno"                   # Secure JS/TS runtime
brew "cmake"                  # Build system
brew "ninja"                  # Fast build tool
brew "mkcert"                 # Local SSL certs
brew "pre-commit"             # Git hooks manager
brew "act"                    # Run GitHub Actions locally
brew "shellcheck"             # Shell script linter
brew "shfmt"                  # Shell formatter

# ═══════════════════════════════════════════════════════════════════════════
# DATA & DATABASES
# ═══════════════════════════════════════════════════════════════════════════
brew "sqlite"                 # SQLite
brew "postgresql@16"          # PostgreSQL
brew "redis"                  # Redis
brew "duckdb"                 # Analytical database

# ═══════════════════════════════════════════════════════════════════════════
# NETWORK & API TOOLS
# ═══════════════════════════════════════════════════════════════════════════
brew "mtr"                    # Network diagnostics
brew "nmap"                   # Port scanner
brew "ngrok"                  # Tunnel to localhost
brew "websocat"               # WebSocket client
brew "grpcurl"                # gRPC curl
brew "mitmproxy"              # HTTP proxy for debugging

# ═══════════════════════════════════════════════════════════════════════════
# FILE TOOLS
# ═══════════════════════════════════════════════════════════════════════════
brew "pandoc"                 # Document converter
brew "poppler"                # PDF tools
brew "tesseract"              # OCR
brew "qrencode"               # QR code generator
brew "p7zip"                  # 7z compression

# ═══════════════════════════════════════════════════════════════════════════
# AI & ML TOOLS
# ═══════════════════════════════════════════════════════════════════════════
brew "ollama"                 # Local LLM runner
brew "llm"                    # CLI for LLMs
brew "huggingface-cli"        # Hugging Face CLI

# ═══════════════════════════════════════════════════════════════════════════
# ADVANCED CLI POWER TOOLS
# ═══════════════════════════════════════════════════════════════════════════
brew "delta"                  # Beautiful git diffs
brew "lazygit"                # Terminal UI for git
brew "lazydocker"             # Terminal UI for docker
brew "bottom"                 # System monitor (btm)
brew "procs"                  # Modern ps replacement
brew "dust"                   # Intuitive du replacement
brew "duf"                    # Better df
brew "broot"                  # Better tree navigator
brew "navi"                   # Interactive cheatsheet
brew "tldr"                   # Simplified man pages
brew "hyperfine"              # Benchmarking tool
brew "tokei"                  # Code statistics
brew "glow"                   # Markdown renderer
brew "choose"                 # Cut/awk alternative
brew "sd"                     # Sed alternative
brew "xh"                     # HTTPie alternative (faster)
brew "dog"                    # DNS lookup (dig alternative)
brew "gping"                  # Ping with graph
brew "bandwhich"              # Network utilization
brew "oha"                    # HTTP load testing
brew "vegeta"                 # HTTP load testing alt
brew "pv"                     # Pipe viewer (progress)
brew "viddy"                  # Modern watch command
brew "entr"                   # Run commands on file change
brew "chafa"                  # Image to terminal
brew "viu"                    # Image viewer in terminal
brew "hexyl"                  # Hex viewer
brew "jless"                  # JSON viewer
brew "fx"                     # JSON viewer alt
brew "csview"                 # CSV viewer
brew "miller"                 # CSV/JSON processor
brew "dasel"                  # JSON/YAML/TOML/XML selector
brew "jo"                     # JSON output from shell
brew "gron"                   # Make JSON greppable
brew "pastel"                 # Color manipulation
brew "difftastic"             # Structural diff
brew "git-absorb"             # Auto fixup commits
brew "git-branchless"         # Git workflow improvements
brew "git-cliff"              # Changelog generator
brew "git-crypt"              # Encrypt files in git
brew "git-filter-repo"        # Fast history rewrite
brew "git-machete"            # Branch management
brew "gitleaks"               # Secret scanner
brew "trufflehog"             # Secret scanner alt
brew "semgrep"                # Code analysis
brew "ast-grep"               # Structural code search
brew "ctop"                   # Container top
brew "dive"                   # Docker image explorer
brew "skopeo"                 # Container image operations
brew "crane"                  # Container registry tool
brew "trivy"                  # Security scanner
brew "k9s"                    # Kubernetes TUI
brew "kubectx"                # Switch k8s contexts
brew "stern"                  # Multi-pod log tailing
brew "kustomize"              # K8s config management
brew "helm"                   # K8s package manager
brew "argocd"                 # GitOps CD
brew "vault"                  # Secret management
brew "step"                   # Certificate management
brew "cfssl"                  # PKI toolkit
brew "pup"                    # HTML parser (like jq for HTML)
brew "htmlq"                  # HTML parser alt
brew "xsv"                    # Fast CSV toolkit
brew "q"                      # SQL on CSV/TSV
brew "usql"                   # Universal SQL CLI
brew "pgcli"                  # Postgres CLI with autocomplete
brew "mycli"                  # MySQL CLI with autocomplete
brew "litecli"                # SQLite CLI with autocomplete
brew "iredis"                 # Redis CLI with autocomplete
brew "fq"                     # jq for binary formats
brew "pueue"                  # Task queue management
brew "tmux"                   # Terminal multiplexer
brew "zellij"                 # Modern terminal multiplexer
brew "atuin"                  # Magical shell history
brew "mcfly"                  # Intelligent history search
brew "nushell"                # Modern shell
brew "fish"                   # Friendly shell
brew "xonsh"                  # Python-powered shell
brew "asdf"                   # Version manager
brew "mise"                   # Polyglot tool manager
brew "chezmoi"                # Dotfiles manager
brew "stow"                   # Symlink farm manager

# ═══════════════════════════════════════════════════════════════════════════
# ADDITIONAL APPLICATIONS
# ═══════════════════════════════════════════════════════════════════════════
cask "warp"                   # Modern terminal
cask "fig"                    # Terminal autocomplete
cask "db-browser-for-sqlite"  # SQLite GUI
cask "postman"                # API testing
cask "insomnia"               # API client (alt)
cask "tableplus"              # Database GUI
cask "cyberduck"              # S3/FTP client
cask "wireshark"              # Network analyzer

# ═══════════════════════════════════════════════════════════════════════════
# PRODUCTIVITY APPLICATIONS
# ═══════════════════════════════════════════════════════════════════════════
cask "arc"                    # Modern browser
cask "firefox-developer-edition" # Dev browser
cask "linear-linear"          # Project management
cask "figma"                  # Design tool
cask "loom"                   # Screen recording
cask "cleanshot"              # Screenshots
cask "imageoptim"             # Image optimization
cask "handbrake"              # Video transcoding
cask "vlc"                    # Media player
cask "spotify"                # Music
cask "calibre"                # E-book management
cask "transmission"           # Torrent client
cask "rectangle"              # Window management
cask "alt-tab"                # Better app switcher
cask "stats"                  # System monitor
cask "battery"                # Battery health
cask "aldente"                # Battery charge limiter
cask "appcleaner"             # Clean uninstalls
cask "suspicious-package"     # Inspect installers
cask "keycastr"               # Show keystrokes
cask "karabiner-elements"     # Keyboard customization
cask "hammerspoon"            # macOS automation
cask "maccy"                  # Clipboard manager
cask "contexts"               # Window switcher
cask "bartender"              # Menu bar management
cask "mimestream"             # Native Gmail client
cask "readdle-spark"          # Email client
cask "fantastical"            # Calendar
cask "cardhop"                # Contacts
cask "numi"                   # Calculator
cask "drafts"                 # Quick capture
cask "devonthink"             # Document management
cask "hookmark"               # Deep linking
cask "marked"                 # Markdown preview
cask "typora"                 # Markdown editor
cask "deckset"                # Presentations

# ═══════════════════════════════════════════════════════════════════════════
# DEVELOPMENT APPLICATIONS
# ═══════════════════════════════════════════════════════════════════════════
cask "jetbrains-toolbox"      # JetBrains IDEs
cask "sublime-text"           # Fast editor
cask "sublime-merge"          # Git client
cask "fork"                   # Git client alt
cask "gitkraken"              # Git client pro
cask "tower"                  # Git client premium
cask "sourcetree"             # Git client free
cask "github-desktop"         # GitHub app
cask "paw"                    # API design tool
cask "proxyman"               # HTTP debugging
cask "charles"                # HTTP debugging alt
cask "hopper-disassembler"    # Reverse engineering
cask "hex-fiend"              # Hex editor
cask "dash"                   # Documentation browser
cask "devutils"               # Developer utilities
cask "paw"                    # API client
cask "rapidapi"               # API platform
cask "ngrok"                  # Tunneling
cask "orbstack"               # Docker desktop alt (fast)
cask "rancher"                # Kubernetes desktop
cask "lens"                   # Kubernetes IDE
cask "mongodb-compass"        # MongoDB GUI
cask "redis-insight"          # Redis GUI (new name)
cask "sequel-ace"             # MySQL client
cask "dbeaver-community"      # Universal DB client
cask "azure-data-studio"      # SQL Server client
cask "robo-3t"                # MongoDB shell
cask "datagrip"               # JetBrains DB IDE

# ═══════════════════════════════════════════════════════════════════════════
# DESIGN & MEDIA
# ═══════════════════════════════════════════════════════════════════════════
cask "sketch"                 # UI design
cask "zeplin"                 # Design handoff
cask "principle"              # Animation prototyping
cask "origami-studio"         # Prototyping
cask "nucleo"                 # Icon manager
cask "iconjar"                # Icon organizer
cask "sip"                    # Color picker
cask "colorsnapper"           # Color picker alt
cask "adobe-creative-cloud"   # Adobe suite
cask "affinity-designer-2"    # Vector design
cask "affinity-photo-2"       # Photo editing
cask "affinity-publisher-2"   # Publishing
cask "pixelmator-pro"         # Image editing
cask "darkroom"               # Photo editing
cask "screenflow"             # Screen recording
cask "obs"                    # Streaming/recording
cask "davinci-resolve"        # Video editing
cask "final-cut-pro"          # Video editing (Apple)
cask "logic-pro"              # Audio production (Apple)
cask "blender"                # 3D creation

# ═══════════════════════════════════════════════════════════════════════════
# AUDIO PRODUCTION
# ═══════════════════════════════════════════════════════════════════════════
cask "ableton-live-suite"     # DAW
cask "native-access"          # Native Instruments
cask "splice"                 # Sample library
cask "loopback"               # Audio routing
cask "audio-hijack"           # Audio capture
cask "soundsource"            # Audio control
cask "farrago"                # Soundboard
cask "fission"                # Audio editing
cask "izotope-product-portal" # iZotope plugins
cask "focusrite-control"      # Audio interface
cask "blackhole-16ch"         # Virtual audio driver
cask "audacity"               # Audio editor (free)
cask "reaper"                 # DAW (affordable)
